# я не совсем понял задание
# Задание 1.
# Создайте класс с методом класса, в котором определялась бы сумма двух целых чисел.

class IntegerAdd:

    def __init__(self, int_1, int_2):
        pass

    def add(self, int_1, int_2):
        return int_1 + int_2

# Задание 2.
# Доработать класс методом-конструктором, в котором следует определить атрибуты экземпляра класса,
# необходимые для сложения двух целых чисел.
# Напишите метод, в котором бы определялась сумма двух целых чисел, переданных через конструктор.
