# Задание 5.
# Создать класс с двумя переменными. Добавить функцию вывода на экран и функцию изменения этих переменных.
# Добавить функцию, которая находит сумму значений этих переменных, и функцию
# которая находит наибольшее значение из этих двух переменных.

# Задание 6.
# Создать класс с двумя переменными. Добавить конструктор с входными параметрами.
# Добавить конструктор, инициализирующий члены класса по умолчанию.
# Добавить деструктор, выводящий на экран сообщение об удалении объекта.

# todo ...
